blog/app/views/articles/_form.html.erb

SELECT "users".* FROM "users" ORDER BY "users"."name" ASC
---
    <%= f.label :user_id, 'Author' %><br>
    <%= f.collection_select :user_id, User.order(:name), :id, :name %>