blog/app/views/users/show.html.erb

SELECT "articles".* FROM "articles" WHERE "articles"."user_id" = ?  [["user_id", 1]]
SELECT  1 AS one FROM "articles" WHERE "articles"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
---

<% if @user.articles.any? %>

SELECT  1 AS one FROM "comments" WHERE "comments"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
---

<% if @user.comments.any? %>