blog/app/controllers/articles_controller.rb

UPDATE "articles" SET "text" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["text", "This is my first article! (edited)"], ["updated_at", "2022-02-02 14:25:33.252906"], ["id", 1]]
---
  def update
    @article = Article.find(params[:id])

    if @article.update(article_params)

DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 2]]
---
  def destroy
    @article = Article.find(params[:id])
    @article.destroy