blog/app/controllers/articles_controller.rb

  def index
    @articles = Article.filter(params.slice(:title, :topic, :user_id, :start_date,
                                            :end_date)).page(params[:page]).order('created_at DESC')
---
SELECT  "articles".* FROM "articles" WHERE (previous_version_date > '2017-03-22 00:00:00') AND "articles"."user_id" = ? AND (previous_version_date < '2027-03-22 00:00:00') ORDER BY created_at DESC LIMIT ? OFFSET ?  [["user_id", 4], ["LIMIT", 10], ["OFFSET", 0]]

  def show
    @article = Article.find(params[:id])
    @comments = Comment.where(article_id: @article.id).paginate(page: params[:page]).order('created_at DESC')
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."article_id" = ? ORDER BY created_at DESC LIMIT ? OFFSET ?  [["article_id", 3], ["LIMIT", 5], ["OFFSET", 0]]

  def create
    @article = Article.new(article_params)
    list_topics
    list_users

    if @article.save
---
INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "dsfasdfdsf"], ["text", "sadfsdf"], ["created_at", "2022-02-04 03:59:57.002489"], ["updated_at", "2022-02-04 03:59:57.002489"]]

  def update
    puts article_params
    puts params
    @article = Article.find(params[:id])
    list_topics
    list_users

    if @article.update(article_params)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "articles" SET "user_id" = ?, "previous_version_date" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["user_id", 5], ["previous_version_date", "2022-03-22 13:51:27.790640"], ["updated_at", "2022-03-22 13:51:33.974694"], ["id", 6]]

  def list_users
    @users = User.all.map { |user| [user.name, user.id] }
---
SELECT "users".* FROM "users"