blog/app/controllers/comments_controller.rb

  def create
    list_users
    @article = Article.find(params[:article_id])
    @comment = @article.comments.create(comment_params)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
INSERT INTO "comments" ("body", "article_id", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["body", "sdfsdf"], ["article_id", 7], ["created_at", "2022-03-22 14:08:58.660252"], ["updated_at", "2022-03-22 14:08:58.660252"], ["user_id", 4]]

  def list_users
    @users = User.all.map { |user| [user.name, user.id] }
---
SELECT "users".* FROM "users"