blog/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE (name like 'Dario Cruz%') AND (email like 'dcruz@altimetrik.com%') AND (birthday > '0001-10-01') ORDER BY created_at DESC LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "users"
---
  def index
    @users = User.filter(params.slice(:name, :email, :birthday)).page(params[:page]).order('created_at DESC')

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
SELECT  "articles".* FROM "articles" WHERE "articles"."user_id" = ? ORDER BY created_at DESC LIMIT ? OFFSET ?  [["user_id", 1], ["LIMIT", 10], ["OFFSET", 0]]
SELECT  "comments".* FROM "comments" WHERE "comments"."user_id" = ? ORDER BY created_at DESC LIMIT ? OFFSET ?  [["user_id", 5], ["LIMIT", 5], ["OFFSET", 0]]
---
  def show
    @user = User.find(params[:id])
    @articles = Article.where(user_id: @user.id).paginate(page: params[:page]).order('created_at DESC')
    @comments = Comment.where(user_id: @user.id).paginate(page: params[:page]).order('created_at DESC')

INSERT INTO "users" ("email", "password", "name", "birthday", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)

    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "admino"], ["updated_at", "2022-03-21 04:21:05.376279"], ["id", 1]]
---
  def update
    @user = User.find(params[:id])

    if @user.update(user_params)