blog/app/models/user.rb

  def create_first_article
    Article.create({ user: self, title: 'First Article', text: "This is the first article of #{name}" })
---
INSERT INTO "articles" ("title", "text", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "First Article"], ["text", "This is the first article of admin"], ["created_at", "2022-03-21 04:15:56.430459"], ["updated_at", "2022-03-21 04:15:56.430459"], ["user_id", 1]]